src/cf/InformationRegisters/ОчередьОбновленияКэширующихДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОчередьОбновленияКэширующихДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗагрузкаОбработанныхДанныхИзДругойСистемы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИзмененияВлияющихДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Попыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаКОбработке</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгое</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОбОшибке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОтметкаВремени</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтметкаВремени</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗависимыйОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВлияющийОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючВлияющихДанных</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОчередьОбновленияКэширующихДанных/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;
	
	МаксимальноеЧислоПопыток = 3;
	Элементы.ПоставитьВОчередьПовторно.Видимость = Запись.Попыток = МаксимальноеЧислоПопыток;
	
	Отбор = Новый Структура("ОтметкаВремени, ЗависимыйОбъектМетаданных, ВлияющийОбъектМетаданных, КлючВлияющихДанных",
		Запись.ОтметкаВремени,
		Запись.ЗависимыйОбъектМетаданных,
		Запись.ВлияющийОбъектМетаданных,
		Запись.КлючВлияющихДанных);
		
	ДанныеЗаписи = РегистрыСведений.ОчередьОбновленияКэширующихДанных.Получить(Отбор);
	СтруктураИзменений = ДанныеЗаписи.ИзмененияВлияющихДанных.Получить();
	Если ТипЗнч(СтруктураИзменений) = Тип("Структура") Тогда
		
		Для Каждого КлючИЗначение1 Из СтруктураИзменений Цикл
			ПредставлениеИзменений = ПредставлениеИзменений + ?(ПредставлениеИзменений = "", "", Символы.ПС);
			Если ТипЗнч(КлючИЗначение1.Значение) = Тип("Структура") Тогда
				ПредставлениеИзменений = ПредставлениеИзменений + 
					СтрШаблон("%1:",
						КлючИЗначение1.Ключ);
				Для Каждого КлючИЗначение2 Из КлючИЗначение1.Значение Цикл
					ПредставлениеИзменений = ПредставлениеИзменений + Символы.ПС;
					ПредставлениеИзменений = ПредставлениеИзменений + 
						СтрШаблон("    %1: %2",
							КлючИЗначение2.Ключ,
							КлючИЗначение2.Значение);
				КонецЦикла;
			Иначе
				ПредставлениеИзменений = ПредставлениеИзменений + 
					СтрШаблон("%1: %2",
						КлючИЗначение1.Ключ,
						КлючИЗначение1.Значение);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоставитьВОчередьПовторно(Команда)
	
	Запись.Попыток = 0;
	Записать();
	
КонецПроцедуры

#КонецОбласти
